[Demo_Common_ep1_3 GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=3900,Y=7590,Z=135),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=-90,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=3900,Y=7400,Z=0),VecSub=(X=90,Y=0,Z=0),CId=71)
DemoScripts[4]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[5]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",motionName[1]="ek_CM_0002_fx_close_smile_S",motionName[2]="ek_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[6]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_Usual_Ekoro.GG2_BGM_DM_Usual_Ekoro_Cue')
DemoScripts[7]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Schoolzone.GG2_AMB_Schoolzone_LP_Cue')
DemoScripts[8]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[9]=(Actor=FADE,Command=WAIT)
DemoScripts[10]=(Actor=WINDOW,Command=SET)
DemoScripts[11]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[12]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0100_fx_close_normal",motionName[1]="ek_CM_0003_fx_close_smile_L",motionName[2]="ek_DM_0102_fx_Stand2Displease",Rate=0,Number=3,Bit=0)
DemoScripts[13]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0200_lp_Displease",Number=8)
DemoScripts[14]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Common_ep1_3.GG2_V_CMN_ep1_3_002_Cue',Name="エコロ")
DemoScripts[15]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[16]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[17]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[18]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[19]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",motionName[1]="ek_CM_0002_fx_close_smile_S",motionName[2]="ek_DM_0201_fx_Displease2Stand",Rate=0,Number=3,Bit=1)
DemoScripts[20]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[21]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Common_ep1_3.GG2_V_CMN_ep1_3_005_Cue',Name="エコロ")
DemoScripts[22]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[23]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[24]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",Rate=0,Number=0,Bit=1)
DemoScripts[25]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Common_ep1_3.GG2_V_CMN_ep1_3_006_Cue',Name="エコロ")
DemoScripts[26]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[27]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[28]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Common_ep1_3.GG2_V_CMN_ep1_3_007_Cue',Name="エコロ")
DemoScripts[29]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[30]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[31]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[32]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Common.GG2_SE_Manpu_Pressure_Cue')
DemoScripts[33]=(Actor=EMOTION,Command=SET,Name="エコロ",Number=1,CId=71)
DemoScripts[34]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0102_lp_close_tightly",motionName[1]="ek_CM_0001_fx_close_down",motionName[2]="ek_DM_0103_fx_Stand2Furry",Rate=0,Number=3,Bit=1)
DemoScripts[35]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0300_lp_Furry",Number=8)
DemoScripts[36]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Common_ep1_3.GG2_V_CMN_ep1_3_009_Cue',Name="エコロ")
DemoScripts[37]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[38]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[39]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[40]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0301_fx_Furry2Stand",Rate=0,Number=3,Bit=1)
DemoScripts[41]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[42]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Common_ep1_3.GG2_V_CMN_ep1_3_011_Cue',Name="エコロ")
DemoScripts[43]=(Actor=TEXT,Command=SET,ID=TEXT11)
DemoScripts[44]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[45]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Common_ep1_3.GG2_V_CMN_ep1_3_012_Cue',Name="エコロ")
DemoScripts[46]=(Actor=TEXT,Command=SET,ID=TEXT12)
DemoScripts[47]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[48]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0105_fx_Stand2Seamon",Rate=0,Number=3,Bit=1)
DemoScripts[49]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0500_lp_Sermon",Number=8)
DemoScripts[50]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Common_ep1_3.GG2_V_CMN_ep1_3_013_Cue',Name="エコロ")
DemoScripts[51]=(Actor=TEXT,Command=SET,ID=TEXT13)
DemoScripts[52]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[53]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Common_ep1_3.GG2_V_CMN_ep1_3_014_Cue',Name="エコロ")
DemoScripts[54]=(Actor=TEXT,Command=SET,ID=TEXT14)
DemoScripts[55]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[56]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0501_fx_Seamon2Stand",Rate=0,Number=3,Bit=1)
DemoScripts[57]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[58]=(Actor=TEXT,Command=SET,ID=TEXT15)
DemoScripts[59]=(Actor=WINDOW,Command=EXIT)
DemoScripts[60]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[61]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[62]=(Actor=AMBIENT,Command=STOP,SecTime=2,SoundID=)
DemoScripts[63]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[64]=(Actor=SYSTEM,Command=END)

[Select_Common_ep1_3 GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Common_ep1_3 GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="峯大",Text="好......好像......發生了很扯的事情......")

Texts[1]=(Label="TEXT02",Name="艾可蘿",Text="呵呵呵....../n這就是學姊直傳的天使絕招!/n是愛的奇蹟! 哼哼!")

Texts[2]=(Label="TEXT03",Name="峯大",Text="呃......喔......?/n這樣啊......?")

Texts[3]=(Label="TEXT04",Name="峯大",Text="(事情好像變得很不得了啊....../n難道說\"太受歡迎傳說\"的學長/n也是這種心情嗎......)")

Texts[4]=(Label="TEXT05",Name="艾可蘿",Text="好了,峯大大人./n來找出註定要和你結合的/n命運的對象吧!")

Texts[5]=(Label="TEXT06",Name="艾可蘿",Text="所謂命運的對象,應該會讓你/n有種靈光一閃的感覺才對.")

Texts[6]=(Label="TEXT07",Name="艾可蘿",Text="而那究竟是不是命運的對象,/n就由我這個精英天使來為你鑑定.")

Texts[7]=(Label="TEXT08",Name="峯大",Text="......是\"見習\"的呢.")

Texts[8]=(Label="TEXT09",Name="艾可蘿",Text="就算是見習的,/n精英還是精英啦--!")

Texts[9]=(Label="TEXT10",Name="峯大",Text="是是是./n我知道了啦./n請多關照囉,艾可蘿.")

Texts[10]=(Label="TEXT11",Name="艾可蘿",Text="那麼,峯大大人./n請你注意,千萬不要/n接受女孩子的告白.")

Texts[11]=(Label="TEXT12",Name="艾可蘿",Text="如果精心力耗光的話,/n就會變成和前來告白的女孩子/n結合的結果.")

Texts[12]=(Label="TEXT13",Name="艾可蘿",Text="不管怎麼說,/n你的戀愛之路只能在今天孤注一擲./n是最後庫存大出清了.")

Texts[13]=(Label="TEXT14",Name="艾可蘿",Text="要是隨波逐流/n和不喜歡的對象結合的話/n之後可就麻煩了哦.")

Texts[14]=(Label="TEXT15",Name="峯大",Text="我知道啦./n我自己也覺得要交女朋友的話/n兩情相悅是最好的嘛.")

Texts[15]=(Label="",Name="",Text="")

Texts[16]=(Label="SELECT01",Name="",Text="")

Texts[17]=(Label="SELECT02",Name="",Text="")

Texts[18]=(Label="SELECT03",Name="",Text="")

Texts[19]=(Label="SELECT04",Name="",Text="")

Texts[20]=(Label="SELECT05",Name="",Text="")

Texts[21]=(Label="SELECT06",Name="",Text="")

Texts[22]=(Label="SELECT07",Name="",Text="")

Texts[23]=(Label="SELECT08",Name="",Text="")

Texts[24]=(Label="SELECT09",Name="",Text="")

Texts[25]=(Label="SELECT10",Name="",Text="")


